.. _aic_userguide:

Italian Code For Identification Of Drugs
========================================

Introduction
------------

The function :func:`clean_it_aic() <dataprep.clean.clean_it_aic.clean_it_aic>` cleans a column containing Italian code for identification of drug (AIC) strings, and standardizes them in a given format. The function :func:`validate_it_aic() <dataprep.clean.clean_it_aic.validate_it_aic>` validates either a single AIC strings, a column of AIC strings or a DataFrame of AIC strings, returning `True` if the value is valid, and `False` otherwise.

AIC strings can be converted to the following formats via the `output_format` parameter:

* `compact`: only number strings without any seperators or whitespace, like "000307052"
* `standard`: AIC strings with proper whitespace in the proper places. Note that in the case of AIC, the compact format is the same as the standard one.
* `base10`: convert a BASE32 representation to a BASE10 one, like "000307052".
* `base32`: convert a BASE10 representation to a BASE32 one, like "009CVD". Note 'compact' may contain both BASE10 and BASE32 represatation.

Invalid parsing is handled with the `errors` parameter:

* `coerce` (default): invalid parsing will be set to NaN
* `ignore`: invalid parsing will return the input
* `raise`: invalid parsing will raise an exception

The following sections demonstrate the functionality of `clean_it_aic()` and `validate_it_aic()`.

### An example dataset containing AIC strings

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {
        "aic": [
            '000307052',
            '999999',
            '7542011030',
            '7552A10004',
            '8019010008',
            "hello",
            np.nan,
            "NULL",
        ], 
        "address": [
            "123 Pine Ave.",
            "main st",
            "1234 west main heights 57033",
            "apt 1 789 s maple rd manhattan",
            "robie house, 789 north main street",
            "1111 S Figueroa St, Los Angeles, CA 90015",
            "(staples center) 1111 S Figueroa St, Los Angeles",
            "hello",
        ]
    }
)
df

          aic                                           address
0   000307052                                     123 Pine Ave.
1      999999                                           main st
2  7542011030                      1234 west main heights 57033
3  7552A10004                    apt 1 789 s maple rd manhattan
4  8019010008                robie house, 789 north main street
5       hello         1111 S Figueroa St, Los Angeles, CA 90015
6         NaN  (staples center) 1111 S Figueroa St, Los Angeles
7        NULL                                             hello

## 1. Default `clean_it_aic`

By default, `clean_it_aic` will clean aic strings and output them in the standard format with proper separators.

In [2]:
from dataprep.clean import clean_it_aic
clean_it_aic(df, column = "aic")

          aic                                           address  aic_clean
0   000307052                                     123 Pine Ave.  000307052
1      999999                                           main st        NaN
2  7542011030                      1234 west main heights 57033        NaN
3  7552A10004                    apt 1 789 s maple rd manhattan        NaN
4  8019010008                robie house, 789 north main street        NaN
5       hello         1111 S Figueroa St, Los Angeles, CA 90015        NaN
6         NaN  (staples center) 1111 S Figueroa St, Los Angeles        NaN
7        NULL                                             hello        NaN

## 2. Output formats

This section demonstrates the output parameter.

### `standard` (default)

In [3]:
clean_it_aic(df, column = "aic", output_format="standard")

          aic                                           address  aic_clean
0   000307052                                     123 Pine Ave.  000307052
1      999999                                           main st        NaN
2  7542011030                      1234 west main heights 57033        NaN
3  7552A10004                    apt 1 789 s maple rd manhattan        NaN
4  8019010008                robie house, 789 north main street        NaN
5       hello         1111 S Figueroa St, Los Angeles, CA 90015        NaN
6         NaN  (staples center) 1111 S Figueroa St, Los Angeles        NaN
7        NULL                                             hello        NaN

### `compact`

In [4]:
clean_it_aic(df, column = "aic", output_format="compact")

          aic                                           address  aic_clean
0   000307052                                     123 Pine Ave.  000307052
1      999999                                           main st        NaN
2  7542011030                      1234 west main heights 57033        NaN
3  7552A10004                    apt 1 789 s maple rd manhattan        NaN
4  8019010008                robie house, 789 north main street        NaN
5       hello         1111 S Figueroa St, Los Angeles, CA 90015        NaN
6         NaN  (staples center) 1111 S Figueroa St, Los Angeles        NaN
7        NULL                                             hello        NaN

### `base10`

In [5]:
clean_it_aic(df, column = "aic", output_format="base10")

          aic                                           address  aic_clean
0   000307052                                     123 Pine Ave.  000307052
1      999999                                           main st        NaN
2  7542011030                      1234 west main heights 57033        NaN
3  7552A10004                    apt 1 789 s maple rd manhattan        NaN
4  8019010008                robie house, 789 north main street        NaN
5       hello         1111 S Figueroa St, Los Angeles, CA 90015        NaN
6         NaN  (staples center) 1111 S Figueroa St, Los Angeles        NaN
7        NULL                                             hello        NaN

### `base32`

In [6]:
clean_it_aic(df, column = "aic", output_format="base32")

          aic                                           address aic_clean
0   000307052                                     123 Pine Ave.    009CVD
1      999999                                           main st       NaN
2  7542011030                      1234 west main heights 57033       NaN
3  7552A10004                    apt 1 789 s maple rd manhattan       NaN
4  8019010008                robie house, 789 north main street       NaN
5       hello         1111 S Figueroa St, Los Angeles, CA 90015       NaN
6         NaN  (staples center) 1111 S Figueroa St, Los Angeles       NaN
7        NULL                                             hello       NaN

## 3. `inplace` parameter

This deletes the given column from the returned DataFrame. 
A new column containing cleaned AIC strings is added with a title in the format `"{original title}_clean"`.

In [7]:
clean_it_aic(df, column="aic", inplace=True)

   aic_clean                                           address
0  000307052                                     123 Pine Ave.
1        NaN                                           main st
2        NaN                      1234 west main heights 57033
3        NaN                    apt 1 789 s maple rd manhattan
4        NaN                robie house, 789 north main street
5        NaN         1111 S Figueroa St, Los Angeles, CA 90015
6        NaN  (staples center) 1111 S Figueroa St, Los Angeles
7        NaN                                             hello

## 4. `errors` parameter

### `coerce` (default)

In [8]:
clean_it_aic(df, "aic", errors="coerce")

          aic                                           address  aic_clean
0   000307052                                     123 Pine Ave.  000307052
1      999999                                           main st        NaN
2  7542011030                      1234 west main heights 57033        NaN
3  7552A10004                    apt 1 789 s maple rd manhattan        NaN
4  8019010008                robie house, 789 north main street        NaN
5       hello         1111 S Figueroa St, Los Angeles, CA 90015        NaN
6         NaN  (staples center) 1111 S Figueroa St, Los Angeles        NaN
7        NULL                                             hello        NaN

### `ignore`

In [9]:
clean_it_aic(df, "aic", errors="ignore")

          aic                                           address   aic_clean
0   000307052                                     123 Pine Ave.   000307052
1      999999                                           main st      999999
2  7542011030                      1234 west main heights 57033  7542011030
3  7552A10004                    apt 1 789 s maple rd manhattan  7552A10004
4  8019010008                robie house, 789 north main street  8019010008
5       hello         1111 S Figueroa St, Los Angeles, CA 90015       hello
6         NaN  (staples center) 1111 S Figueroa St, Los Angeles         NaN
7        NULL                                             hello         NaN

## 4. `validate_it_aic()`

`validate_it_aic()` returns `True` when the input is a valid AIC. Otherwise it returns `False`.

The input of `validate_it_aic()` can be a string, a Pandas DataSeries, a Dask DataSeries, a Pandas DataFrame and a dask DataFrame.

When the input is a string, a Pandas DataSeries or a Dask DataSeries, user doesn't need to specify a column name to be validated. 

When the input is a Pandas DataFrame or a dask DataFrame, user can both specify or not specify a column name to be validated. If user specify the column name, `validate_it_aic()` only returns the validation result for the specified column. If user doesn't specify the column name, `validate_it_aic()` returns the validation result for the whole DataFrame.

In [10]:
from dataprep.clean import validate_it_aic
print(validate_it_aic('000307052'))
print(validate_it_aic('999999'))
print(validate_it_aic('7542011030'))
print(validate_it_aic('7552A10004'))
print(validate_it_aic('8019010008'))
print(validate_it_aic("hello"))
print(validate_it_aic(np.nan))
print(validate_it_aic("NULL"))

True
False
False
False
False
False
False
False

### Series

In [11]:
validate_it_aic(df["aic"])

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
Name: aic, dtype: bool

### DataFrame + Specify Column

In [12]:
validate_it_aic(df, column="aic")

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
Name: aic, dtype: bool

### Only DataFrame

In [13]:
validate_it_aic(df)

     aic  address
0   True    False
1  False    False
2  False    False
3  False    False
4  False    False
5  False    False
6  False    False
7  False    False